Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Specify what destination ref to update with what source object.
zh_cn: 指定要使用源对象更新的目标引用。

source: Specifying -b causes a new branch to be created as if git-branch[1] were called and then checked out.
zh_cn: 指定 -b 将创建一个新的分支，就像调用了 git-branch[1] ，然后检出。

source: Specifying --no-local will override the default when /path/to/repo is given, using the regular Git transport instead.
zh_cn: 当使用 /path/to/repo 时，指定 --no-local 会覆盖默认值，使用正常的 Git 传输。

source: Specifying a directory will include all unresolved files in that path.
zh_cn: 指定目录将包括该路径中的所有未解析文件。

source: Spend extra cycles to find renames, copies and complete rewrites (very expensive).
zh_cn: 花费额外的周期来查找重命名，复制和完成重写(非常昂贵)。

source: Split a commit apart into a sequence of commits
zh_cn: 将提交分解成一系列提交

source: Splits mail messages in a mailbox into commit log message, authorship information and patches, and applies them to the current branch.
zh_cn: 将邮箱中的邮件拆分为提交日志消息，作者信息和补丁，并将其应用于当前分支。

source: Start a new Git repository for an existing code base
zh_cn: 为现有代码库启动一个新的 Git 仓库

source: Start cleaning files and directories, and then quit.
zh_cn: 开始清理文件和目录，然后退出。

source: Start development from a known tag
zh_cn: 从已知标签开始开发

source: Starting point at which to create the new commits.
zh_cn: 创建新提交的起点。

source: Stash the changes in a dirty working directory away
zh_cn: 把脏工作目录中的更改暂存

source: Stashes may also be referenced by specifying just the stash index (e.g. the integer n is equivalent to stash@{n}).
zh_cn: 也可以通过指定储藏索引(例如，整数 n 等同于 stash@{n} )来引用储藏。

source: Store a given stash created via git stash create (which is a dangling merge commit) in the stash ref, updating the stash reflog.
zh_cn: 在储藏引乃用中一个存储通过 git stash create创建的储藏 (这是一个悬空的合并提交)，更新储藏 reflog。

source: Stores the current contents of the index in a new commit along with a log message from the user describing the changes.
zh_cn: 将索引中的当前内容与用户描述更改的日志消息一起存储在新提交中。

source: Strip leading and trailing empty lines, trailing whitespace, commentary and collapse consecutive empty lines.
zh_cn: 删除前导和尾随空行，尾随空格，注释和折叠连续空行。

source: Submitting patches to a project
zh_cn: 将补丁提交到项目

source: Submodules
zh_cn: 子模块

source: Subsequent changes to the working tree can be found by comparing these attributes.
zh_cn: 通过比较这些属性可以找到工作树的后续更改。

source: Such a configuration file may look like this:
zh_cn: 这样的配置文件可能如下所示：

source: Such names are globally unique.
zh_cn: 这些名字是全局唯一的。

source: Summarize git log output
zh_cn: 总结 git log 输出

source: Summarizes git log output in a format suitable for inclusion in release announcements.
zh_cn: 以适合包含在发布公告中的格式汇总 git log 输出。

source: Suppose you want to remove a file (containing confidential information or copyright violation) from all commits:
zh_cn: 假设您要从所有提交中移除文件(包含机密信息或侵犯版权)：

source: Suppress all output; instead exit with zero status if <object> exists and is a valid object.
zh_cn: 抑制所有输出;如果<object>存在并且是有效对象，则退出零状态。

source: Suppress commit summary message.
zh_cn: 抑制提交的概要消息。

source: Switch branches or restore working tree files
zh_cn: 切换分支或恢复工作树文件

source: Symbolic Identifiers
zh_cn: 符号标识符

source: Synching repositories
zh_cn: 同步仓库

source: Syntax
zh_cn: 语法

source: System-wide configuration file.
zh_cn: 系统范围的配置文件。

source: TEMPORARY FILES
zh_cn: 临时文件

source: Tag Object
zh_cn: 标签对象

source: Tag objects (created with -a, -s, or -u) are called "annotated" tags; they contain a creation date, the tagger name and e-mail, a tagging message, and an optional GnuPG signature.
zh_cn: 标签对象(使用 -a ， -s 或 -u 创建)被称为"annotated"标签;它们包含创建日期，标记名称和电子邮件，标记消息和可选的 GnuPG 签名。

source: Tags for the deepened commits are not fetched.
zh_cn: 更深的提交的标签不会被抓取。

source: Take an existing commit object, and reuse the log message and the authorship information (including the timestamp) when creating the commit.
zh_cn: 获取现有的提交对象，并在创建提交时重用日志消息和作者信息(包括时间戳)。

source: Take care with these alternatives as both will discard uncommitted changes in your working directory.
zh_cn: 注意这些替代方案，因为两者都将丢弃您的工作目录中未提交的更改。

source: Take the commit message from the given file.
zh_cn: 从给定的文件中获取提交消息。

source: Take the configuration from the given file instead of .git/config. Using the "--global" option forces this to ~/.gitconfig. Using the "--system" option forces this to $(prefix)/etc/gitconfig.
zh_cn: 从给定的文件而不是 .git/config 中进行配置。使用“--global”选项强制这个为 ~/.gitconfig 。使用“--system”选项强制这个为 $(prefix)/etc/gitconfig。

source: Takes the patches given on the command line and emails them out.
zh_cn: 取得命令行上给出补丁并发送给他们。

source: Tell the command to automatically stage files that have been modified and deleted, but new files you have not told Git about are not affected.
zh_cn: 告诉命令自动对已经被修改和删除的文件进行暂存，但是你没有告诉 Git 的新文件不受影响。

source: Telling Git your name
zh_cn: 告诉 git 你的名字

source: Temporarily setting aside work in progress
zh_cn: 暂时搁置正在进行的工作

source: Terminology
zh_cn: 术语

source: Testing partial commits
zh_cn: 测试部分提交

source: That is, a pattern followed by an attributes list, separated by whitespaces.
zh_cn: 也就是说，模式后跟一个属性列表，由空格分隔。

source: That is, instead of creating <directory> and placing the administrative files in <directory>/.git, make the <directory> itself the $GIT_DIR.
zh_cn: 也就是说，不要创建 <directory> 并将管理文件放在 <directory>/.git 中，使 <directory> 本身 $GIT_DIR。

source: That is, this example does the same as the earlier example if there is no other change in your working tree:
zh_cn: 也就是说，如果您的工作树中没有其他更改，则该示例与前面的示例相同：

source: That setting can be overridden by using the --track and --no-track options, and changed later using git branch --set-upstream-to.
zh_cn: 可以通过使用 --track 和 --no-track 选项来覆盖该设置，稍后使用 git branch --set-upstream-to。

source: The "delete" subcommand deletes single entries from the reflog.
zh_cn: "delete" 子命令从 reflog 中删除单个条目。

source: The "exists" subcommand checks whether a ref has a reflog.
zh_cn: "exists" 子命令检查一个引用是否有 reflog。

source: The "expire" subcommand prunes older reflog entries.
zh_cn: "expire" 子命令修剪较旧的 reflog 条目。

source: The "humanish" part of the source repository is used if no directory is explicitly given (repo for /path/to/repo.git and foo for host.xz:foo/.git).
zh_cn: 如果没有明确指定目录，则使用源库的"人性化"部分(repo for /path/to/repo.git and foo for host.xz:foo/.git。

source: The "index" holds a snapshot of the content of the working tree, and it is this snapshot that is taken as the contents of the next commit.
zh_cn: "index"保存工作树内容的快照，并将该快照作为下一个提交的内容。

source: The "magic signature" consists of ASCII symbols that are neither alphanumeric, glob, regex special characters nor colon.
zh_cn: "魔术签名" 由不是字母数字，glob，正则表达式特殊字符或冒号的 ASCII 符号组成。

source: The "remote" repository that is destination of a push operation.
zh_cn: 作为推送操作的目标的"远程"仓库。

source: The "remote" repository that is the source of a fetch or pull operation.
zh_cn: 作为抓取或拉取操作的源的"远程"仓库。

source: The "show" subcommand (which is also the default, in the absence of any subcommands) shows the log of the reference provided in the command-line (or HEAD, by default).
zh_cn: "show" 子命令(在没有任何子命令的情况下也是默认值)显示命令行中提供的引用的日志(或默认情况下为 HEAD )。

source: The .git directory contains, among other things, a compressed object database representing the complete history of the project, an "index" file which links that history to the current contents of the working tree, and named pointers into that history such as tags and branch heads.
zh_cn: .git 目录包含代表项目完整历史的压缩对象数据库，将该历史记录链接到工作树的当前内容的 "index" 文件，及指向该历史记录的命名指针，如标签和分支头。

source: The Git concepts chapter of the user-manual and gitcore-tutorial[7] both provide introductions to the underlying Git architecture.
zh_cn: Git 用户手册的概念章节 和 gitcore-tutorial[7] 都提供了基础Git架构的介绍。

source: The Git User’s Manual has a more in-depth introduction.
zh_cn: Git 用户手册有更深入的介绍。

source: The --dry-run option can be used to obtain a summary of what is included by any of the above for the next commit by giving the same set of parameters (options and paths).
zh_cn: 可以使用 --dry-run 选项，并给出相同的参数集(选项和路径)，来获取通过上述任何方工包含的准备下一个提交的内容的摘要。

source: The --global and the --system options will limit the file used to the global or system-wide file respectively.
zh_cn: --global 和 --system 选项将分别限制用于全局或全系统文件的文件。

source: The .git/config file in each repository is used to store the configuration for that repository, and $HOME/.gitconfig is used to store a per-user configuration as fallback values for the .git/config file.
zh_cn: 每个存储库中的 .git/config 文件用于存储该存储库的配置，并且 $HOME/.gitconfig 用于将每个用户配置存储为备用。

source: The .gitmodules file, located in the top-level directory of a Git working tree, is a text file with a syntax matching the requirements of git-config[1].
zh_cn: 位于 Git 工作树顶级目录中的 .gitmodules 文件是一个符合 git-config[1] 要求的语法的文本文件。

source: The CHERRY_PICK_HEAD ref is set to point at the commit that introduced the change that is difficult to apply.
zh_cn: CHERRY_PICK_HEAD 引用设置为指向引入了难以应用的更改的提交。

source: The GIT_AUTHOR_DATE, GIT_COMMITTER_DATE environment variables and the --date option support the following date formats:
zh_cn: GIT_AUTHOR_DATE ， GIT_COMMITTER_DATE 环境变量和 --date 选项支持以下日期格式：

source: The commit.template configuration variable is often used to give this option implicitly to the command.
zh_cn: 通常使用 commit.template 配置变量将该选项隐式地提供给该命令。

source: The git add command will not add ignored files by default.
zh_cn: 默认情况下， git add 命令不会添加忽略的文件。

source: The git status command can be used to obtain a summary of which files have changes that are staged for the next commit.
zh_cn: 可以使用 git status 命令来获取有关哪些文件暂存用于下一次提交的摘要。

source: The keyid argument is optional and defaults to the committer identity; if specified, it must be stuck to the option without a space.
zh_cn: keyid 参数是可选的，默认为提交者标识;如果指定，则必须将其粘贴到没有空格的选项。

source: The pu branch will be updated even if it is does not fast-forward, because it is prefixed with a plus sign; tmp will not be.
zh_cn: 即使没有快进， pu 分支也将被更新，因为它的前缀有一个加号; tmp 则不会。

source: The --namespace command-line option also sets this value.
zh_cn: --namespace命令行选项也会设置此值。

source: The --git-dir command-line option also sets this value.
zh_cn: --git-dir 命令行选项也会设置此值。

source: The GIT_CONFIG environment variable has a similar effect, but you can specify any filename you want.
zh_cn: 环境变量 GIT_CONFIG 具有相似的效果，但您可以指定所需的任何文件名。

source: The <dst> tells which ref on the remote side is updated with this push.
zh_cn: <dst>告诉远程端的哪个引用使用这个推送进行更新。

source: The # and ; characters begin comments to the end of line, blank lines are ignored.
zh_cn: # 和 ; 字符开始注释到行尾，空行被忽略。

source: The <mode> can be strip, whitespace, verbatim, scissors or default.
zh_cn: <mode> 可以是 strip, whitespace, verbatim, scissors 或 default。

source: The format:<string> format allows you to specify which information you want to show.
zh_cn: format:<string> 格式允许您指定要显示的信息。

source: The man program is used by default for this purpose, but this can be overridden by other options or configuration variables.
zh_cn: 默认情况下， man 程序用于此目的，但可以由其他选项或配置变量覆盖。

source: The raw format shows the entire commit exactly as stored in the commit object.
zh_cn: raw 格式显示完整存储在提交对象中的完整提交。

source: The info program will be used for that purpose.
zh_cn: info 程序将用于此目的。

source: The git add command can be used to add ignored files with the -f (force) option.
zh_cn: git add 命令可用于使用 -f (强制)选项添加忽略的文件。

source: The <file> list given to the command can be exact pathnames, file glob patterns, or leading directory names.
zh_cn: 提供给命令的 <file> 列表可以是精确的路径名，文件 glob 模式或目录开头名称。

source: The <message> part is optional and gives the description along with the stashed state.
zh_cn: <message>部分是可选的，并给出描述以及隐藏的状态。

source: The <mode> must be one of the following:
zh_cn: <mode>必须是以下之一：

source: The <name> is expected in the same format as listed by git config (subkeys separated by dots).
zh_cn: 预期 <name> 的格式与 git config (由点分隔的子项)列出的格式相同。

source: The <src> is often the name of the branch you would want to push, but it can be any arbitrary "SHA-1 expression", such as master~4 or HEAD (see gitrevisions[7]).
zh_cn: <src>通常是要推送的分支的名称，但它可以是任意任意的"SHA-1表达式"，例如 master~4 或 HEAD (见 gitrevisions[7] )。

source: The <tree-ish> argument can be used to specify a specific tree-ish (i.e. commit, tag or tree) to update the index for the given paths before updating the working tree.
zh_cn: 在更新工作树之前，可以使用<tree-ish>参数来指定特定的 tree-ish (即提交，标签或树)来更新给定路径的索引。

source: The <tree-ish>/<commit> defaults to HEAD in all forms.
zh_cn: 所有形式的<tree-ish>/<commit>默认为 HEAD。

source: The Git Repository
zh_cn: Git 仓库

source: The Git configuration file contains a number of variables that affect the Git commands' behavior.
zh_cn: Git 配置文件包含一些影响 Git 命令行为的变量。

source: The Git repository browser
zh_cn: Git 仓库浏览器

source: The Object Database
zh_cn: 对象数据库

source: The Workflow
zh_cn: 工作流程

source: The above command copies all branches from the remote refs/heads/ namespace and stores them to the local refs/remotes/origin/ namespace, unless the branch.<name>.fetch option is used to specify a non-default refspec.
zh_cn: 上述命令从远程 refs/heads/ 命名空间复制所有分支，并将它们存储到本地的 refs/remotes/origin/ 中，除非使用 branch.<name>.fetch 选项指定非默认的 refspec。

source: The action of updating all or part of the working tree with a tree object or blob from the object database, and updating the index and HEAD if the whole working tree has been pointed at a new branch.
zh_cn: 通过 object database 中的 tree object 或 blob 更新全部或部分 working tree 的动作，并且如果整个工作树指向新的 branch ，则更新 index 和 HEAD 。

source: The addition will appear reverted in the working tree.
zh_cn: 该添加将在工作树中显示为还原。

source: The attributes (last modified time, size, etc.) are taken from the corresponding file in the working tree.
zh_cn: 属性(最后修改的时间，大小等)取自工作树中相应的文件。

source: The blob object represents the contents of the file as of the head of the current branch.
zh_cn: blob 对象表示当前分支头部的文件内容。

source: The branch must be fully merged in its upstream branch, or in HEAD if no upstream was set with --track or --set-upstream.
zh_cn: 该分支必须在其上游分支中完全合并，或在 HEAD 没有上游设置为 --track 或 --set-upstream 。

source: The changes staged for hello.c and hello.h are not included in the resulting commit.
zh_cn: 生成的提交中不包括 hello.c 和 hello.h 的更改。

source: The chosen hunks are applied in reverse to the index.
zh_cn: 所选的块反向应用到索引。

source: The chosen hunks are then applied in reverse to the working tree (and if a <tree-ish> was specified, the index).
zh_cn: 然后将所选择的 hunks 反向应用于工作树(并且如果指定了<tree-ish>，则为索引)。

source: The command git commit -a first looks at your working tree, notices that you have modified hello.c and removed goodbye.c, and performs necessary git add and git rm for you.
zh_cn: 命令 git commit -a 首先查看你的工作树，注意你修改了 hello.c 并删除了 goodbye.c，并执行必要的 git add 和 git rm。

source: The command git fetch <name> can then be used to create and update remote-tracking branches <name>/<branch>.
zh_cn: 然后可以使用命令 git fetch <name> 创建和更新远程跟踪分支 <name>/<branch>。

source: The command finds the most recent tag that is reachable from a commit.
zh_cn: 该命令查找从提交可访问的最新标记。

source: The command loop shows the list of subcommands available, and gives a prompt "What now> ".
zh_cn: 命令循环显示可用的子命令列表，并提示"What now>"。

source: The command removes only the paths that are known to Git.
zh_cn: 该命令仅删除 Git 已知的路径。

source: The command saves your local modifications away and reverts the working directory to match the HEAD commit.
zh_cn: 该命令保存您的本地修改，并恢复工作目录以匹配 HEAD 提交。

source: The command shall still exit with non-zero status.
zh_cn: 命令仍然以非零状态退出。

source: The command takes options applicable to the git rev-list command to control what is shown and how, and options applicable to the git diff-* commands to control how the changes each commit introduces are shown.
zh_cn: 该命令采用适用于 git rev-list 命令的选项来控制显示的内容以及如何以显示，使用适用于 git diff-* 命令的选项，以控制每个提交的介绍如何显示。

source: The command takes options applicable to the git diff-tree command to control how the changes the commit introduces are shown.
zh_cn: 该命令采用适用于 git diff-tree 命令的选项来控制如何显示提交引入的更改。

source: The command takes options applicable to the git log command to control what is shown and how.
zh_cn: 该命令采用适用于 git log 命令的选项来控制显示的内容和方法。

source: The command takes various subcommands, and different options depending on the subcommand:
zh_cn: 该命令需要各种子命令，不同的选项取决于子命令：

source: The command will be given exactly two or four arguments: the username@host (or just host) from the URL and the shell command to execute on that remote system, optionally preceded by -p (literally) and the port from the URL when it specifies something other than the default SSH port.
zh_cn: 该命令将被给出两个或四个参数： username@host （或只是host）从 URL 和 shell 命令在该远程系统上执行，可选地前缀为 -p（字面上）和port，当它指定不是默认 SSH 端口的URL时。

source: The command will only rewrite the positive refs mentioned in the command line (e.g. if you pass a..b, only b will be rewritten).
zh_cn: 该命令只会重写命令行中提到的 positive 参数（例如，如果传递 a..b ，则只会重写 b 。

source: The command’s second form creates a new branch head named <branchname> which points to the current HEAD, or <start-point> if given.
zh_cn: 命令的第二个形式创建一个名为 <branchname> 的新分支头，它指向当前的 HEAD 或<start-point>（如果给定）。

source: The commit message subject line is taken from the specified commit with a prefix of "squash!
zh_cn: 提交消息主题行来自指定的提交，前缀为"squash!

source: The commit message will be the subject line from the specified commit with a prefix of "fixup!
zh_cn: 提交消息将是来自指定提交的主题行，前缀为"fixup!

source: The commit, equivalent to what other systems call a "changeset" or "version", represents a step in the project’s history, and each parent represents an immediately preceding step.
zh_cn: 提交等同于其他系统称为“变更集”或“版本”，表示项目历史中的一个步骤，每个父提交代表一个紧接在前的步骤。

source: The commits that were previously saved into the temporary area are then reapplied to the current branch, one by one, in order.
zh_cn: 然后之前保存到临时区域的提交，将依次重新应用于当前分支。

source: The configuration variable add.ignoreErrors can be set to true to make this the default behaviour.
zh_cn: 可以将配置变量 add.ignoreErrors 设置为 true，使其成为默认行为。

source: The configuration variable gpg.program is used to specify custom GnuPG binary.
zh_cn: 配置变量 gpg.program 用于指定自定义 GnuPG 二进制。

source: The configuration variables are used by both the Git plumbing and the porcelains.
zh_cn: 配置变量由 Git 低级命令和高级命令使用。

source: The construct @{-<n>} means the <n>th branch/commit checked out before the current one.
zh_cn: @{-<n>} 的结构意味着在当前第一个分支/提交之前检出第 n 个分支/提交。

source: The content to be added can be specified in several ways:
zh_cn: 要添加的内容可以通过以下几种方式指定：

source: The contents from a specific side of the merge can be checked out of the index by using --ours or --theirs.
zh_cn: 通过使用 --ours 或 --theirs ，可以从索引中检出合并特定方面的内容。

source: The contents of these files are also staged for the next commit on top of what have been staged before.
zh_cn: 这些文件的内容也会暂存于之前已暂存文件的顶部，用于下一次提交。

source: The current branch.
zh_cn: 当前的 branch 。

source: The current branch and HEAD pointer stay at the last commit successfully made.
zh_cn: 当前分支和 HEAD 指针保持在最后一次成功的提交。

source: The current branch is reset to <upstream>, or <newbase> if the --onto option was supplied.
zh_cn: 则当前分支将重置为 <upstream>，或者 <newbase> 如果提供了--onto 选项。

source: The default behavior of this command when no <refspec> is given can be configured by setting the push option of the remote, or the push.default configuration variable.
zh_cn: 当没有给出 <refspec> 时，该命令的默认行为可以由远程的 push 选项或 push.default 配置变量配置。

source: The default can be changed by the commit.cleanup configuration variable (see git-config[1]).
zh_cn: 默认值可以通过 commit.cleanup 配置变量来更改(参见 git-config[1] )。

source: The default can be changed using the status.showUntrackedFiles configuration variable documented in git-config[1].
zh_cn: 可以使用 git-config[1] 中记录的 status.showUntrackedFiles 配置变量来更改默认值。

source: The default is not to print any annotation lines.
zh_cn: 默认情况下不打印任何注解行。

source: The easiest way to do so is:
zh_cn: 最简单的方法是：

source: The editor used to edit the commit log message will be chosen from the GIT_EDITOR environment variable, the core.editor configuration variable, the VISUAL environment variable, or the EDITOR environment variable (in that order).
zh_cn: 用于编辑提交日志消息的编辑器将从 GIT_EDITOR 环境变量，core.editor 配置变量， VISUAL 环境变量或 EDITOR 环境变量(按顺序)。

source: The entire history leading up to a commit can be vouched for by signing just that commit.
zh_cn: 整个历史上一些重要的提交可以签名那个提交来表示。

source: The executable bit is only changed in the index, the files on disk are left unchanged.
zh_cn: 可执行位只在索引中更改，磁盘上的文件保持不变。

source: The fast-import backend itself can import into an empty repository (one that has already been initialized by git init) or incrementally update an existing populated repository.
zh_cn: 快速导入后端本身可以导入到一个空的存储库(已经由 git init 初始化了)或逐步更新现有的填充存储库。

source: The fetched objects will eventually be removed by git’s built-in housekeeping (see git-gc[1]).
zh_cn: 获取的对象最终将被 git 的内置内务管理(请参阅 git-gc[1] )删除。

source: The file hello.c will also be checked out, even though it is no longer in the working tree, because the file globbing is used to match entries in the index (not in the working tree by the shell).
zh_cn: 文件 hello.c 也将被检出，即使它不再在工作树中，因为文件 globbing 用于匹配索引中的条目（不在工作树中的 shell） ）。

source: The file /etc/gitconfig can be used to store a system-wide default configuration.
zh_cn: 文件 /etc/gitconfig 可用于存储系统范围的默认配置。

source: The file contains one subsection per submodule, and the subsection value is the name of the submodule.
zh_cn: 该文件每个子模块包含一个子部分，子部分值是子模块的名称。

source: The file parameters can point at the user’s working file (e.g. new-file in "git-diff-files"), /dev/null (e.g. old-file when a new file is added), or a temporary file (e.g. old-file in the index).
zh_cn: 该文件参数可以指向用户的工作文件 (如 "git-diff-files" 中的new-file), /dev/null (如当新文件添另时的 old-file ), 或临时文件 (如 index 中的 old-file ).

source: The files are read in the order given above, with last value found taking precedence over values read earlier.
zh_cn: 文件以上面给出的顺序读取，最后找到的值优先于先前阅读的值。

source: The files under .git/objects/ directory are hardlinked to save space when possible.
zh_cn: .git/objects/ 目录下的文件是硬链接的，以尽可能节省空间。

source: The first are what you would commit by running git commit; the second and third are what you could commit by running git add before running git commit.
zh_cn: 第一个是您 将 通过运行 git commit 来提交，第二个和第三个你 可以 在运行 git commit 之前运行 git add 来提交。

source: The first command fetches the maint branch from the repository at git://git.kernel.org/pub/scm/git/git.git and the second command uses FETCH_HEAD to examine the branch with git-log[1].
zh_cn: 第一个命令从 git://git.kernel.org/pub/scm/git/git.git 从仓库中获取 maint 分支，第二个命令通过 FETCH_HEAD 用 git-log[1] 检查分支。

source: The following are all commit-ishes: a commit object, a tag object that points to a commit object, a tag object that points to a tag object that points to a commit object, etc.
zh_cn: 以下是所有的 commit-ishes：提交对象，指向提交对象的 tag object ，指向一个，指向提交对象的标签对象的标签对象等。

source: The following are helper commands used by the above; end users typically do not use them directly.
zh_cn: 以下是上述使用的辅助命令；终端用户通常不直接使用它们。

source: The following description divides the low-level commands into commands that manipulate objects (in the repository, index, and working tree), commands that interrogate and compare objects, and commands that move objects and references between repositories.
zh_cn: 以下描述将低级别命令分为操纵对象命令(在仓库，索引和工作树中)，询问和比较对象的命令，以及在仓库之间移动对象和引用的命令。

source: The following is probably more detail than necessary for a first-time user.
zh_cn: 以下可能比第一次使用者需要的细节更详细。

source: The following options affect the way the simplification is performed:
zh_cn: 以下选项会影响简化的执行方式：

source: The following options select the commits to be shown:
zh_cn: 以下选项选择要显示的提交：

source: The following sequence checks out the master branch, reverts the Makefile to two revisions back, deletes hello.c by mistake, and gets it back from the index.
zh_cn: 以下顺序检出 master 分支，将 Makefile 还原两个版本，错误地删除 hello.c，并从索引中取回。

source: The following syntaxes may be used with them:
zh_cn: 可以使用以下语法：

source: The format of a <refspec> parameter is an optional plus +, followed by the source object <src>, followed by a colon :, followed by the destination ref <dst>.
zh_cn: <refstec>参数的格式是可选加号 + ，后跟源对象 <src>，后跟冒号 : ，后跟目标引用 <dst>。
